In [20]:
import pandas as pd

In [21]:
#Answer 1-
#Creating Series Directly
ser=pd.Series([4,8,15,16,23,42])

In [22]:
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [23]:
#Answewr 2-
data = [4,8,15,16,23,42]

ser1=pd.Series(data)

In [24]:
ser1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [25]:
#Answer 3-
data = { "Name" :["Alice","Bob","Claire"],
        "Age" : [25,30,27,],
        "Gender" : ["Female" , "Male","Female"]
}

In [26]:
df = pd.DataFrame(data)

In [27]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#Answer 4-

In pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types.
It is essentially a table or spreadsheet-like data structure where each column can have a different data type 
(e.g., numeric, string, boolean, etc.). It is similar to a Series, but a DataFrame can have multiple columns andit has a row index and a column index.

Example To illustrate Diffrence between DataFrame & Series:-

In [30]:
# create a dictionary with two Series
data = {'name': pd.Series(['Alice', 'Bob', 'Charlie']),
        'age': pd.Series([25, 30, 35])}

# create a DataFrame from the dictionary
df = pd.DataFrame(data)

# print the DataFrame
df

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35


You can see that the resulting DataFrame has two columns, 'name' and 'age', and three rows. Each column is a Series object,
but combined they form a DataFrame with a row index and a column index. The Series objects in a DataFrame can have different lengths, 
but the DataFrame will automatically align them based on the index.

In summary, a Series is a one-dimensional labeled array capable of holding data of any type, while a DataFrame is a two-dimensional labeled 
data structure with columns of potentially different types. A DataFrame is more suitable for representing and analyzing structured data that has multiple variables or features.

#Answer 5-

head() and tail(): -These functions are used to display the first or last n rows of a DataFrame, respectively. They are useful to quickly get a sense of what the data looks like.


describe(): - This function generates descriptive statistics of a DataFrame, including count, mean, standard deviation, minimum, maximum, and quartiles. It is useful to get a quick summary of the distribution of the data.

In [31]:
#HEAD & TAIL FUNCTION
df1 = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie'],
                   'age': [25, 30, 35],
                   'country': ['USA', 'Canada', 'UK']})

In [32]:
df1.head(2)

    name  age country
0  Alice   25     USA
1    Bob   30  Canada

In [33]:
df1.tail()

      name  age country
0    Alice   25     USA
1      Bob   30  Canada
2  Charlie   35      UK

In [34]:
#DESCRIBE FUNCTION
df1.describe()

        age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

#Answer 6-

A Series and DataFrame are mutable in nature in pandas, while a Panel is not mutable, but can be replaced with a new Panel.

In other words, you can modify the values in a Series or DataFrame after they have been created. For example, you can add, delete, or update elements in a Series, or add, delete, or modify rows or columns in a DataFrame. This is because they are designed to represent tabular or spreadsheet-like data that can be manipulated.

However, a Panel is a three-dimensional data structure in pandas, which is essentially a collection of DataFrame objects. While you cannot modify a Panel directly, you can replace it with a new Panel that has different values. This is because a Panel is intended to represent data that has an extra dimension, such as a time series with multiple variables.

In [37]:
#Anser 7-

name_series = pd.Series(['Alice', 'Bob', 'Charlie'])
age_series = pd.Series([25, 30, 35])
country_series = pd.Series(['USA', 'Canada', 'UK'])

df = pd.DataFrame({'name': name_series, 'age': age_series, 'country': country_series})

In [38]:
df

      name  age country
0    Alice   25     USA
1      Bob   30  Canada
2  Charlie   35      UK

In this example, first create three Series for name, age, and country. Then,  pass them as arguments to the pd.DataFrame() function to create a new DataFrame. The resulting DataFrame has three columns, one for each Series, and an index that corresponds to the index of the original Series.